w10d1/Music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 5]]
---
<ul>
<% @band.albums.each do |album| %>