w10d1/Music_app/app/models/user.rb

    def self.find_by_credentials(email, password)
      user = User.find_by(email: email)  #User.find(1)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "brennan@brennan.com"], ["LIMIT", 1]]