w10d1/Music_app/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
<h4>Band Name:
<% @band = Band.find(params[:band_id])  %>