w10d1/Music_app/app/controllers/albums_controller.rb

    def create
      if logged_in?
        # fail
        # album_params
        # @album_params[:studio] == 'studio' ? @album_params[:studio] = true : @album_params[:studio] = false
        title = album_params[:title]
        year = album_params[:year]
        band_id = album_params[:band_id]
        if album_params[:studio] == "live"
            studio = false
        else
            studio = true
        end

        @album = Album.new(title: title, year: year, band_id: band_id, studio: studio)

        # if @album.studio == "studio"
        #   @album.studio = true
        # else
        #   @album.studio = false
        # end

        if @album.save
---
INSERT INTO "albums" ("title", "band_id", "year", "studio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "wkolp"], ["band_id", 5], ["year", 3], ["studio", true], ["created_at", "2019-10-07 02:47:29.273377"], ["updated_at", "2019-10-07 02:47:29.273377"]]

    def show
        @album = Album.find(params[:id])
        @band = Band.find(@album.band_id)
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]