w10d1/Music_app/app/controllers/application_controller.rb

  def login_user!(user)
    @current_user = user
    session[:session_token] = @current_user.reset_session_token!
    @current_user.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "jmiLYyKCcj0GdYvnWXJNng"], ["updated_at", "2019-10-06 23:13:27.763290"], ["id", 2]]

  def logout_user!
    if logged_in?
    @current_user.reset_session_token!
    @current_user.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "jVF1zEhRptgxMWr-uH3PoQ"], ["updated_at", "2019-10-06 23:14:03.801959"], ["id", 2]]