w10d1/Music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "poop"], ["created_at", "2019-10-07 00:01:09.138942"], ["updated_at", "2019-10-07 00:01:09.138942"]]
---
  def create
    if logged_in?
      @band = Band.new(name: params[:band][:name])
      if @band.save

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @band = Band.find(params[:id])

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "poopoo"], ["updated_at", "2019-10-07 00:17:16.282252"], ["id", 1]]
---
  def update
    @band = Band.find(params[:id])
    @band.name = params[:band][:name]
    if @band.save

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    if logged_in?
      @band = Band.find(params[:id])

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 1]]
---
  def destroy
    if logged_in?
      @band = Band.find(params[:id])
      @band.destroy